

    	    var map;
    	    var NissanIcon = new GIcon(G_DEFAULT_ICON);
    	    //NissanIcon.image = 'images/nissan_logo.gif';
    	    NissanIcon.image = '/TC/images/buying/map_icon.png';
    	    NissanIcon.shadow = '';
    	    // 自訂圖標大小
    	    NissanIcon.iconSize = new GSize(50, 22);
    	    markerOptions = { icon: NissanIcon };

    	    function GetUrlParam(paramName) {
    	        var oRegex = new RegExp('[\?&]' + paramName + '=([^&]+)', 'i');
    	        var oMatch = oRegex.exec(window.top.location.search);

    	        if (oMatch && oMatch.length > 1)
    	            return oMatch[1];
    	        else
    	            return '';
    	    }
    	    function initialize() {
    	        if (GBrowserIsCompatible()) {
    	            map = new GMap2(document.getElementById("map_1"));
    	            var p = GetUrlParam("Serch");
    	           // var p0 = GetUrlParam("p0");
    	            // alert(p);
    	            // alert(p0);
    	             map.setCenter(new GLatLng(25.047924, 121.517081), 11);
    	            map.setUIToDefault();
    	        }
    	        geocoder = new GClientGeocoder();

    	        addPoint();
    	    }
           //加入據點
	    function AddService(spoint, sname, saddr, s, sphone, spkey, scitycode) {
	        var html = '<div style="width:300px">'
				 + '<b><a ' + s + '><font>' + sname + '</font></a></b><br/>'
				 + saddr + '<br>' + sphone + '<br>';
	        var marker = new GMarker(spoint, markerOptions);
	        map.addOverlay(marker);
	        GEvent.addListener(marker, "click", function () {
	            marker.openInfoWindowHtml(html);
				var getsactive = QueryString("active");
				location.href='/TC/buycar/locations.aspx?active='+getsactive+'&Serch='+spoint+'&pkey='+spkey+'&cityid='+scitycode;
				
	        });
	    }
function addPoint() {


var SP53 = new GLatLng(23.9777913, 121.58187069999997); 
AddService(SP53, '永勝服務廠', '花蓮縣吉安鄉永勝街8號', '10', '03-8523277 ', '9359b15a-25c3-4fc9-add9-82db55dc48ec', '41000');





  







        var marker = new GMarker(new GLatLng(25.047924, 121.517081)); //建立標籤的經緯度
                    map.addOverlay(marker); //顯示標籤
                    marker.openInfoWindowHtml("您所查詢的位置"); //顯示對話框及文字
    }

var SP54 = new GLatLng(25.0727106, 121.54076910000003); 
AddService(SP54, '濱江服務廠', '台北市中山區濱江街213號', '10', '02-25175000', '5601d2c8-d70d-4c14-a0a0-833fc1ab2a1b', '11000');
var SP69 = new GLatLng(25.0312498, 121.4973503); 
 AddService(SP69, '萬華服務廠', '台北市萬華區莒光路328號', '10', '02-23062607 ', '656e2edf-9302-4134-b15c-a5a2ab291f76', '11000');
 var SP72 = new GLatLng(25.0482524, 121.55989669999997); 
 AddService(SP72, '八德服務廠', '台北市松山區八德路四段68號', '10', '02-27621088 ', '26d0e12d-4a1d-4092-b335-ad4858c5e849', '11000');
var SP8 = new GLatLng(25.1045947, 121.5183246); 
AddService(SP8, '文林服務廠', '台北市士林區文林北路43號', '10', '02-28234998 ', 'cae958a3-37ba-4507-bc8a-1963cc763244', '11000');
var SP9 = new GLatLng(25.068115, 121.567893); 
AddService(SP9, '撫遠服務廠', '台北市松山區撫遠街423號', '10', '02-27607267 ', '7c3ff141-c02e-4b26-ac88-1a9d356d8214', '11000');
var SP10 = new GLatLng(25.0306864, 121.54382340000006); 
AddService(SP10, '瑞安服務廠', '台北市大安區復興南路二段65號', '10', '02-27075355 ', '42636a13-5ad5-410b-b48f-1b83629b4cbf', '11000');
var SP12 = new GLatLng(24.9881233, 121.55301350000002); 
AddService(SP12, '木柵服務廠', '台北市文山區木柵路一段257巷1號', '10', '02-29383999 ', '601bec3e-6924-49b1-a4cd-239c9a501f4b', '11000');
var SP28 = new GLatLng(25.126846, 121.49774389999993); 
AddService(SP28, '北投服務廠', '台北市北投區大業路265號', '10', '02-28952060', '313006bc-e19c-47f6-aa62-3c3e0bf6a1d7', '11000');
var SP50 = new GLatLng(25.0686119, 121.5827693); 
AddService(SP50, '民權服務廠', '台北市內湖區民權東路六段23號1樓', '10', '02-27915617', '1dd85efd-efe5-4729-9f5d-81d970306584', '11000');
var SP51 = new GLatLng(25.0686119, 121.5827693); 
AddService(SP51, '民權服務廠', '台北市內湖區民權東路六段23號1樓', '10', '02-27915617', '1dd85efd-efe5-4729-9f5d-81d970306584', '11000');
var SP89 = new GLatLng(25.0483594, 121.58500170000002); 
AddService(SP89, '忠孝服務廠', '台北市南港區忠孝東路六段101號', '10', '02-26531855 ', '186edf64-118d-4f78-a520-de8a4bb3fb47', '11000');
var SP98 = new GLatLng(25.0212357, 121.55560479999997); 
AddService(SP98, '大安服務廠', '台北市大安區和平東路三段268號', '10', '02-23776365 ', 'ce4b7f50-0d67-463d-9fcf-f26238dec52d', '11000');

var SP66 = new GLatLng(25.1007883, 121.71960409999997); 
AddService(SP66, '七堵服務廠', '基隆市七堵區八德路2之16號', '10', '02-24551333 ', '78083dcf-ef55-4320-a97b-999e3965af4f', '10000');

var SP0 = new GLatLng(25.0716924, 121.3746658); 
AddService(SP0, '林口服務廠', '新北市林口區文化一路一段98號', '10', '02-26003800 ', '834b05c5-3dde-4a39-84d9-003f54a0b387', '12000');
var SP6 = new GLatLng(24.9308581, 121.38294159999998); 
AddService(SP6, '三峽服務廠', '新北市三峽區介壽路一段365號', '10', '02-26731000 ', '96c114fc-08f4-4516-8454-12e4c2171e51', '12000');
var SP14 = new GLatLng(25.005227, 121.48216879999995); 
AddService(SP14, '中和服務廠', '新北市中和區中山路二段594號', '10', '02-82212372 ', '871cfde9-b3a4-4a61-9796-2635a94c8088', '12000');
var SP33 = new GLatLng(25.0310605, 121.42913380000005); 
AddService(SP33, '輔大服務廠', '新北市新莊區中正路562號', '10', '02-29031177 ', '3459d0ec-3815-4ff8-8869-511d6191213e', '12000');
var SP56 = new GLatLng(25.0429101, 121.46031600000003);
AddService(SP56, '新莊服務廠', '新北市新莊區思源路40-1號', '10', '02-89935288 ', '4d971486-24a6-4feb-b636-8652003510f6', '12000');
var SP41 = new GLatLng(24.998428, 121.42312300000003); 
AddService(SP41, '土城服務廠', '新北市土城區大安路85號', '10', '02-22681158 ', '6f9c1367-afaa-45e2-80c4-64a3570cffd7', '12000');
var SP62 = new GLatLng(25.1408169, 121.45996890000004); 
AddService(SP62, '淡水服務廠', '新北市淡水區民權路39號', '10', '02-28090092 ', '0ced4c3c-45b4-40a6-bf4c-937f97d69a8a', '12000');
var SP71 = new GLatLng(24.977451, 121.545344); 
AddService(SP71, '新店服務廠', '新北市新店區中興路三段9號', '10', '02-89199922', '5f6fe9a4-c101-4121-aef5-aab1e0e24668', '12000');
var SP93 = new GLatLng(25.0551372, 121.63281269999993); 
AddService(SP93, '汐止服務廠', '新北市汐止區大同路一段154-5號', '10', '02-86432888 ', '2f8dda93-baa3-4e90-b7f4-ec319fa4ede2', '12000');
var SP94 = new GLatLng(25.028847, 121.4716204); 
AddService(SP94, '板橋服務廠', '新北市板橋區文化路2段266號', '10', '02-82523006 ', '175c9a32-879e-4d23-a64a-ed3c7172df2c', '12000');
var SP101 = new GLatLng(25.0877249, 121.484009); 
AddService(SP101, '集賢服務廠', '新北市三重區集賢路１９５號', '10', '02-28576633 ', '4ecbd012-77a9-4b4d-b60c-fa521e7ae204', '12000');

var SP99 = new GLatLng(24.7666226, 121.76145969999993); 
AddService(SP99, '宜蘭服務廠', '宜蘭縣宜蘭市宜興路三段28號', '10', '03-9289989 ', 'fccd806d-dd5a-443d-b1ad-f5cdbc52ca91', '42000');
var SP60 = new GLatLng(24.6864379, 121.76875389999998); 
AddService(SP60, '羅東服務廠', '宜蘭縣羅東鎮純精路三段416號', '10', '03-9530123 ', 'ba26c18d-0e3e-4a82-a086-918e0675200a', '42000');


var SP44 = new GLatLng(24.7812926, 121.00633990000006); 
AddService(SP44, '園區服務廠', '新竹市東區科學工業園區新安路200號', '10', '03-5612434 ', 'c8aa027b-b753-4368-8f75-68e17b77accb', '14000');
var SP91 = new GLatLng(24.816305, 120.99329260000002); 
AddService(SP91, '新竹服務廠', '新竹市東區經國路一段二號', '10', '03-5331188 ', 'cbc50919-e50a-4678-adc1-e6507aa677a2', '14000');
var SP100 = new GLatLng(24.7912737, 120.93795380000006); 
AddService(SP100, '香山服務廠', '新竹市香山區中華路4段468號', '10', '03-5301682 ', '4b3bb4c0-3a8a-4bf5-803a-f6097f084ee6', '14000');

var SP29 = new GLatLng(24.8495621, 121.00495479999995); 
AddService(SP29, '竹北服務廠', '新竹縣竹北市中華路752號', '10', '03-5514216 ', 'b6bcb0d1-b27e-4b29-8e8b-42e96c971df9', '15000');
var SP46 = new GLatLng(24.754685, 121.07135489999996); 
AddService(SP46, '竹東服務廠', '新竹縣竹東鎮中興路一段169號', '10', '03-5831818 ', '69398667-6033-4346-a690-7ac08dc30d71', '15000');

var SP23 = new GLatLng(24.9669726, 121.23636550000003); 
AddService(SP23, '北中壢服務廠', '桃園縣中壢市中園路170號', '10', '03-4527111', '9f5e6d0c-f385-43a7-8b7a-303f01bb8c35', '13000');
var SP48 = new GLatLng(24.9430792, 121.2277441); 
AddService(SP48, '中壢服務廠', '桃園縣中壢市環中東路二段731號', '10', '03-4598981 ', 'ef95a170-d1a7-4157-bf6f-7eacc0cfb7b8', '13000');
var SP49 = new GLatLng(24.9430792, 121.2277441); 
AddService(SP49, '中壢服務廠', '桃園縣中壢市環中東路二段731號', '10', '03-4598981 ', 'ef95a170-d1a7-4157-bf6f-7eacc0cfb7b8', '13000');

var SP24 = new GLatLng(24.9384168, 121.29748810000001); 
AddService(SP24, '八德服務廠', '桃園縣八德市介壽路二段 731號', '10', '03-3681111 ', 'c6c26d4e-0876-4139-8f27-31072c38d1e2', '13000');
var SP25 = new GLatLng(25.0587902, 121.2757398); 
AddService(SP25, '南崁服務廠', '桃園縣蘆竹鄉南崁路二段180號', '10', '03-3521122  ', 'acdfa543-6e1b-4d6a-b8b0-37c07bd4a6ca', '13000');
var SP26 = new GLatLng(25.0587902, 121.2757398); 
AddService(SP26, '南崁服務廠', '桃園縣蘆竹鄉南崁路二段180號', '10', '03-3521122  ', 'acdfa543-6e1b-4d6a-b8b0-37c07bd4a6ca', '13000');
var SP34 = new GLatLng(24.9075437, 121.15152809999995); 
AddService(SP34, '楊梅服務廠', '桃園縣楊梅市中山北路一段75號', '10', '03-4780666  ', 'ad220e8f-e220-43f5-9d49-511ec9b499c6', '13000');
var SP40 = new GLatLng(24.8662702, 121.21005839999998); 
AddService(SP40, '龍潭服務廠', '桃園縣龍潭鄉中豐路中山段206號', '10', '03-4891789 ', 'fa72fff2-bf34-447e-ae65-5dfc8782e081', '13000');
var SP43 = new GLatLng(24.9799334, 121.27339740000002); 
AddService(SP43, '桃園服務廠', '桃園縣桃園市中山路1310號', '10', '03-3601119  ', '3e05558e-7cb1-4a1f-ad9a-65c2d7895000', '13000');
var SP65 = new GLatLng(24.9782328, 121.32231449999995); 
AddService(SP65, '桃鶯服務廠', '桃園縣桃園市桃鶯路441號', '10', '03-3752266  ', 'eb26a62c-e779-4148-9053-972b2f018d75', '13000');
var SP74 = new GLatLng(24.9317568, 121.19719520000001); 
AddService(SP74, '平鎮服務廠', '桃園縣平鎮市延平路三段588號', '10', '03-4644888 ', '6551a532-fe6d-404a-a1ac-c08a6f02c978', '13000');

var SP57 = new GLatLng(24.6892572, 120.91036680000002); 
AddService(SP57, '頭份服務廠', '苗栗縣頭份鎮自強路98號', '10', '037-689977 ', '6984ec03-ab57-4fa3-a37f-8aa862894f70', '20000');
var SP67 = new GLatLng(24.5744043, 120.8172194); 
AddService(SP67, '苗栗服務廠', '苗栗縣苗栗市國華路658號', '10', '037-337037  ', 'f2f62b18-8928-42f7-8dfd-9cf30dbc2182', '20000');
var SP80 = new GLatLng(24.4310444, 120.64576139999997);
AddService(SP80, '苑裡服務廠', '苗栗縣苑裡鎮房裡里南房69之6號', '10', '037-852355 ', '79614449-445f-4df8-a2f3-cba32f16b3f6', '20000');

var SP3 = new GLatLng(24.126101, 120.55990459999998); 
AddService(SP3, '大肚服務廠', '台中市大肚區沙田路一段682號', '10', '04-26935175 ', 'f3f12a65-9377-4280-a547-090860458a38', '21000');
var SP4 = new GLatLng(24.232306, 120.70894350000003); 
AddService(SP4, '豐原服務廠', '台中市潭子區中山路三段438號', '10', '04-25329707', '6548b2da-cfd8-40c3-bb2d-0ad5f23400ec', '21000');
var SP5 = new GLatLng(24.232306, 120.70894350000003); 
AddService(SP5, '豐原服務廠', '台中市潭子區中山路三段438號', '10', '04-25329707', '6548b2da-cfd8-40c3-bb2d-0ad5f23400ec', '21000');
var SP11 = new GLatLng(24.3514735, 120.62817399999994); 
AddService(SP11, '大甲服務廠', '台中市大甲區中山路一段972-2號', '10', '04-26860828', '65e0c924-f51d-4190-8f48-1b9dcf1de2fa', '21000');

var SP39 = new GLatLng(24.1525321, 120.68246670000008); 
AddService(SP39, '中台中服務廠', '台中市北區中華路二段126號', '10', '04-22067199 ', '380fcb31-0c5a-4751-80a3-5c7fe7fddf76', '21000');
var SP55 = new GLatLng(24.1820584, 120.68314729999997); 
AddService(SP55, '松竹服務廠', '台中市北屯區松竹路三段8號', '10', '04-22470636 ', 'd3da5f3b-e02d-444c-b2bc-85a120b58882', '21000');
var SP31 = new GLatLng(24.162115, 120.63261080000007); 
AddService(SP31, '市政服務廠', '台中市西屯區市政路638號', '10', '04-22591719 ', '017265bf-2460-4010-bd81-48b42a71415f', '21000');
var SP58 = new GLatLng(24.1849412, 120.61690420000002); 
AddService(SP58, '西屯服務廠', '台中市西屯區福康路89號', '10', '04-24637888 ', 'e40d057d-d851-48ec-be1c-8bfc0317e594', '21000');
var SP63 = new GLatLng(24.1666887, 120.60125270000003); 
AddService(SP63, '工業區服務廠', '台中市西屯區工業區36路27號', '10', '04-23599966 ', '2bf62773-08e8-47a6-bd50-941a108406fa', '21000');
var SP78 = new GLatLng(24.1723588, 120.66439860000003); 
AddService(SP78, '北台中服務廠', '台中市西屯區文心路三段456號', '10', '04-23129111  ', '3e6a64fd-87a8-4356-a4bb-c838406a3bbf', '21000');
var SP81 = new GLatLng(24.1313254, 120.70359389999999); 
AddService(SP81, '東台中服務廠', '台中市東區振興路379之1號', '10', '04-22115758 ', '2e1b3b59-d7e7-4cff-abd5-cf8d101bd233', '21000');
var SP82 = new GLatLng(24.1313254, 120.70359389999999); 
AddService(SP82, '東台中服務廠', '台中市東區振興路379之1號', '10', '04-22115758 ', '2e1b3b59-d7e7-4cff-abd5-cf8d101bd233', '21000');
var SP77 = new GLatLng(24.1082721, 120.63902380000002); 
AddService(SP77, '南台中服務廠', '台中市烏日區中山路一段37號', '10', '04-23362355 ', 'b7b05edc-9986-40d9-a072-c6485c270bce', '21000');
var SP97 = new GLatLng(24.2308848, 120.57392430000004); 
AddService(SP97, '沙鹿服務廠', '台中市沙鹿區台灣大道七段955號', '10', '04-26629822 ', '8224404e-c956-4175-9df6-ef687f0329aa', '21000');
var SP42 = new GLatLng(24.0983361, 120.68288899999993); 
AddService(SP42, '大里服務廠', '台中市大里區國光路一段151號', '10', '04-24065100 ', '0c2428d3-d4c7-4b66-9327-6548bbf8437c', '21000');

var SP17 = new GLatLng(23.9901213, 120.56310580000002); 
AddService(SP17, '員林服務廠', '彰化縣大村鄉中山路二段329號', '10', '04-8532377 ', '1853932e-4c98-41b6-b913-2778411cc1bc', '22000');
var SP18 = new GLatLng(23.9901213, 120.56310580000002); 
AddService(SP18, '員林服務廠', '彰化縣大村鄉中山路二段329號', '10', '04-8532377 ', '1853932e-4c98-41b6-b913-2778411cc1bc', '22000');
var SP68 = new GLatLng(24.0863223, 120.53243910000003); 
AddService(SP68, '彰化服務廠', '彰化縣彰化市金馬路三段221號', '10', '04-7294000 ', 'e475e9eb-c416-40ed-b93a-a1075ff8b2bf', '22000');
var SP70 = new GLatLng(23.9545356, 120.49056180000002); 
AddService(SP70, '溪湖服務廠', '彰化縣溪湖鎮員鹿路二段141號', '10', '04-8829090 ', '357be6bd-5814-432d-ac3c-a83ddfdc0852', '22000');
var SP90 = new GLatLng(24.0469705, 120.44869979999999); 
AddService(SP90, '鹿港服務廠', '彰化縣福興鄉彰鹿路七段339號', '10', '04-7765610', '6e241a86-d4ac-4394-8f5e-e19e72423fd2', '22000');

var SP15 = new GLatLng(23.9696907, 120.95347820000006); 
AddService(SP15, '埔里服務廠', '南投縣埔里鎮中山路三段475號', '10', '049-2911901  ', '52499c38-c89e-467f-9099-26afe05f2577', '23000');
var SP32 = new GLatLng(23.7603863, 120.68429300000003); 
AddService(SP32, '竹山服務廠', '南投縣竹山鎮大明路306號', '10', '049-2649982', '09b1f21b-17b1-494b-8e52-4e21b5ad80fd', '23000');
var SP59 = new GLatLng(23.9354874, 120.66559200000006); 
AddService(SP59, '南投服務廠', '南投縣南投市南崗三路276號', '10', '049-2252016 ', '06420b20-627b-45d5-af09-8d86363d2f98', '23000');


var SP45 = new GLatLng(23.4668086, 120.42630209999993);
AddService(SP45, '博賢服務廠', '嘉義市西區世賢路二段505號', '10', '05-2834566 ', '249b7f99-81b3-4837-a606-6f9f776bed09', '30000');
var SP87 = new GLatLng(23.5050062, 120.44799999999998); 
AddService(SP87, '忠孝服務廠', '嘉義市東區忠孝路728號', '10', '05-2773755 ', '3771e057-6be9-44f8-9c9b-dd20449b37cd', '30000');
var SP88 = new GLatLng(23.5050062, 120.44799999999998); 
AddService(SP88, '忠孝服務廠', '嘉義市東區忠孝路728號', '10', '05-2773755 ', '3771e057-6be9-44f8-9c9b-dd20449b37cd', '30000');

var SP64 = new GLatLng(23.4643004, 120.26536920000001);
AddService(SP64, '朴子服務廠', '嘉義縣朴子市大糠榔1313號', '10', '05-3702307 ', 'c2086ad1-b03a-4f11-bba8-96eccddeebb2', '31000');

var SP19 = new GLatLng(23.5876704, 120.30454780000002); 
AddService(SP19, '北港服務廠', '雲林縣北港鎮新德路93號', '10', '05-7832806 ', '3b9983bd-8b60-44c3-a414-29030a771545', '24000');
var SP20 = new GLatLng(23.5876704, 120.30454780000002); 
AddService(SP20, '北港服務廠', '雲林縣北港鎮新德路93號', '10', '05-7832806 ', '3b9983bd-8b60-44c3-a414-29030a771545', '24000');
var SP21 = new GLatLng(23.6945887, 120.46545630000003); 
AddService(SP21, '斗南服務廠', '雲林縣斗南鎮大業路212號', '10', '05-5978117 ', '9e17980d-1a5f-494d-8f80-2cae3f1b20c5', '24000');
var SP92 = new GLatLng(23.7017467, 120.55249070000002); 
AddService(SP92, '斗六服務廠', '雲林縣斗六市大學路二段33號', '10', '05-5354366 ', '4921da83-1b4d-44ba-8672-eb86b15a072c', '24000');


var SP2 = new GLatLng(23.1328677, 120.28225769999995); 
AddService(SP2, '善化服務廠', '台南市善化區興農路50號', '10', '06-5812100', 'be46becf-028b-460a-8389-090831e68919', '32000');
var SP13 = new GLatLng(23.0227453, 120.21923070000003); 
AddService(SP13, '永康服務廠', '台南市永康區中華路995號', '10', '06-2521560', '319b6b2a-8381-47d0-9488-260c445f2d0e', '32000');
var SP27 = new GLatLng(23.021567, 120.26162629999999); 
AddService(SP27, '永大服務廠', '台南市永康區永大路二段1296號', '10', '06-2020051', '84ab7787-d832-4eb2-8f94-3ae68b5ccfac', '32000');
var SP30 = new GLatLng(23.3085322, 120.30522580000002); 
AddService(SP30, '新營服務廠', '台南市新營區民治路198號', '10', '06-6561447', '9995549a-1adc-4075-aa96-430a5fd548ce', '32000');
var SP35 = new GLatLng(22.9706654, 120.26009249999993); 
AddService(SP35, '仁德服務廠', '台南市仁德區中山路246號', '10', '06-2707345', '7c0fb82e-dbea-47b6-b0d0-5683f92c5b8b', '32000');
var SP83 = new GLatLng(23.1652848, 120.18834470000002); 
AddService(SP83, '佳里服務廠', '台南市佳里區民安里同安寮1－29號', '10', '06-7231002', '3cb4e6da-1fa8-4319-a4e4-d56055e396f8', '32000');
// var SP84 = new GLatLng(23.1652848, 120.18834470000002); 
// AddService(SP84, '佳里服務廠', '台南市佳里區民安里同安寮1－29號', '10', '06-7231002', '3cb4e6da-1fa8-4319-a4e4-d56055e396f8', '32000');
var SP85 = new GLatLng(22.9756203, 120.18403319999993); 
AddService(SP85, '健康服務廠', '台南市南區中華西路一段79號', '10', '06-2915011', 'c83be6d6-faf0-46af-8a4f-d9f11027d67a', '32000');
// var SP86 = new GLatLng(22.9756203, 120.18403319999993); 
// AddService(SP86, '健康服務廠', '台南市南區中華西路一段79號', '10', '06-2915011', 'c83be6d6-faf0-46af-8a4f-d9f11027d67a', '32000');
var SP95 = new GLatLng(22.9773664, 120.22640369999999); 
AddService(SP95, '中華服務廠', '台南市東區中華東路三段１５１號', '10', '06-2689943', '25f4d454-55f9-4be3-97bf-ee32e1ae5f89', '32000');
// var SP96 = new GLatLng(22.9773664, 120.22640369999999); 
// AddService(SP96, '中華服務廠', '台南市東區中華東路三段１５１號', '10', '06-2689943', '25f4d454-55f9-4be3-97bf-ee32e1ae5f89', '32000');

var SP7 = new GLatLng(22.7507589, 120.35145360000001); 
AddService(SP7, '旗山服務廠', '高雄市旗山區旗楠一路375之23號', '10', '07-6613758 ', '48d85805-44cf-4925-be7a-14e827e17a7e', '33000');

var SP16 = new GLatLng(22.6085373, 120.3173021); 
AddService(SP16, '一心服務廠', '高雄市前鎮區一心一路356號', '10', '07-7138787  ', '9fda62c3-fdcf-4d4c-8c05-276b274a800e', '33000');

var SP22 = new GLatLng(22.6775941, 120.32113830000003); 
AddService(SP22, '大中服務廠', '高雄市左營區大中一路399號', '10', '07-3462555 ', '36058f51-b05b-4759-b066-2ff335c429ff', '33000');

var SP37 = new GLatLng(22.6291358, 120.347444); 
AddService(SP37, '鳳山服務廠', '高雄市鳳山區光復路二段89號', '10', '07-7902888 ', '610fab50-2f7c-4bc4-b026-5b4716c2ac6f', '33000');
var SP38 = new GLatLng(22.6291358, 120.347444); 
AddService(SP38, '鳳山服務廠', '高雄市鳳山區光復路二段89號', '10', '07-7902888 ', '610fab50-2f7c-4bc4-b026-5b4716c2ac6f', '33000');

var SP47 = new GLatLng(22.6427952, 120.3417091); 
AddService(SP47, '陽明服務廠', '高雄市三民區陽明路259號', '10', '07-3812789 ', 'a34b3481-ef40-4e06-bfac-7c2ab05ea846', '33000');

var SP61 = new GLatLng(22.8084312, 120.28447140000003); 
AddService(SP61, '岡山服務廠', '高雄市岡山區岡山北路26號', '10', '07-6217166 ', 'ab956d68-3b47-44c5-be7b-924994ca4f77', '33000');

var SP73 = new GLatLng(22.7210992, 120.28922060000002); 
AddService(SP73, '右昌服務廠', '高雄市楠梓區德民路938號', '10', '07-3662555 ', '0b367384-31a3-48db-8563-b4981574c424', '33000');

var SP75 = new GLatLng(22.5695838, 120.35754129999998); 
AddService(SP75, '小港服務廠', '高雄市小港區宏平路433號', '10', '07-8031587 ', '908fa8b8-216b-4cb1-ac65-c4c8b1fcfc6d', '33000');
var SP76 = new GLatLng(22.5695838, 120.35754129999998); 
AddService(SP76, '小港服務廠', '高雄市小港區宏平路433號', '10', '07-8031587 ', '908fa8b8-216b-4cb1-ac65-c4c8b1fcfc6d', '33000');

var SP1 = new GLatLng(22.6589, 120.50331759999995); 
AddService(SP1, '和生服務廠', '屏東縣屏東市工業五路4號', '10', '08-7233785 ', '4cfaa2d3-c033-4554-b474-066e8d45e75e', '34000');

var SP36 = new GLatLng(22.686899, 120.48940300000004); 
AddService(SP36, '屏北服務廠', '屏東縣屏東市忠孝路188號', '10', '08-7652223  ', 'c4927e56-e266-4066-9103-5a3892119fab', '34000');

var SP52 = new GLatLng(22.516938, 120.53061300000002); 
AddService(SP52, '潮州服務廠', '屏東縣潮州鎮光復路229號', '10', '08-7881002 ', 'c7fdd948-9467-4700-b6a1-823ddd04b808', '34000');

var SP79 = new GLatLng(22.7558754, 121.12952270000005); 
AddService(SP79, '台東服務廠', '台東縣台東市正氣北路606號', '10', '089 219050 ', 'ffb10447-f4d4-4654-8562-cb3c00ad86a3', '40000');
 

